Revit 2027 API
MultistoryStairs.GetAllConnectedLevels Method
 Gets all connected level ids of this multistory stairs.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ISet<ElementId> GetAllConnectedLevels()
Public Function GetAllConnectedLevels As ISet(Of ElementId)
public:
ISet<ElementId^>^ GetAllConnectedLevels()
member GetAllConnectedLevels : unit -> ISet<ElementId>
Return Value
ISet<ElementId>
 The ids of connected levels.
See Also
Reference
MultistoryStairs Class
Autodesk.Revit.DB.Architecture Namespace